export const issueObj = {
  홈: [
    "오늘 UP",
    "오늘 신작",
    "오리지널",
    "완결까지 정주행",
    "독립운동가 웹툰",
    "오늘 랭킹",
  ],
  요일연재: [],
  웹툰: [],
  소년: ["독점 신작", "이벤트로 달리자", "ㄸㅂㅇㄹ ㄹㅂㅇ"],
  드라마: ["월간 베스트#20", "#이벤트로달리자", "완결까지#정주행"],
  로맨스: ["완결까지 정주행", "인기완결작", "기다무플러스"],
  로판: ["월간 베스트", "스테디셀러정주행", "기다무플러스"],
  액션무협: ["독점 신작", "이벤트로 달리자", "기다무 플러스"],
  BL: [
    "지난달의 BL",
    "인기 완결작",
    "기다무 플러스",
    "오늘도 선물",
    "BL 소설",
    "오늘의 이벤트",
  ],
};

export const rowListTitleObj = {
  recommendation: { name: "recommend", title: "오늘의 추천" },
  romanceTop: { name: "romance", title: "로맨스 TOP"},
};
